app/controllers/restaurantes_controller.rb

SELECT `restaurantes`.* FROM `restaurantes` ORDER BY `restaurantes`.`nome` ASC
---
	def index
		@restaurantes = Restaurante.order :nome

SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 14 LIMIT 1
---
	def show
		@restaurante = Restaurante.find(params[:id])

SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 17 LIMIT 1
DELETE FROM `restaurantes` WHERE `restaurantes`.`id` = 17
---
	def destroy
		@restaurante = Restaurante.find(params[:id])
		@restaurante.destroy

INSERT INTO `restaurantes` (`created_at`, `endereco`, `especialidade`, `nome`, `updated_at`) VALUES ('2014-01-07 16:44:18', 'Rua Iaiá, 18', 'Italiano', 'Sergio Arno', '2014-01-07 16:44:18')
---
	def create
		@restaurante = Restaurante.new(restaurante_params)
		if @restaurante.save

SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 53 LIMIT 1
---
	def edit
		@restaurante = Restaurante.find(params[:id])

SELECT `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 49 LIMIT 1
UPDATE `restaurantes` SET `nome` = 'Restaurante 1001', `updated_at` = '2014-01-07 19:10:23' WHERE `restaurantes`.`id` = 13
---
	def update
		@restaurante = Restaurante.find(params[:id])
		@restaurante.update_attributes(restaurante_params)